---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistVert
source: html/2084234d-75fe-07fb-16b3-bbbf8c09f76d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistVert Property

"Use Curve Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId CurtaingridUseCurveDistVert { get; }
```